---
kind: type
id: T:Autodesk.Revit.DB.ForgeTypeId
source: html/d9fcf276-9566-de83-2b0b-d89b65ccc8af.htm
---
# Autodesk.Revit.DB.ForgeTypeId

This class holds a string that uniquely identifies a Forge schema.

## Syntax (C#)
```csharp
public class ForgeTypeId : IDisposable
```